#Использовать asserts
#Использовать 1connector
#Использовать ".."

Перем Логин;
Перем Пароль;

#Область ПередИПосле
&Перед
Процедура ПередЗапускомТеста() Экспорт	
	JSON = Новый Структура;
	JSON.Вставить("name", Логин);
	JSON.Вставить("password", Пароль);

	Ответ = КоннекторHTTP.Post("localhost:5984/_session", , JSON);
	Параметры = Новый Структура("Cookies", Ответ.Cookies);
	Ответ = КоннекторHTTP.Put("localhost:5984/test/", , , Параметры);
КонецПроцедуры

&После
Процедура ПослеЗапускаТеста() Экспорт
	JSON = Новый Структура;
	JSON.Вставить("name", Логин);
	JSON.Вставить("password", Пароль);

	Ответ = КоннекторHTTP.Post("localhost:5984/_session", , JSON);
	Параметры = Новый Структура("Cookies", Ответ.Cookies);
	Ответ = КоннекторHTTP.Delete("localhost:5984/test/", , , Параметры);	
КонецПроцедуры
#КонецОбласти

Логин = "vissarion249";
Пароль = "pankkiller249";
