#Использовать asserts
#Использовать entity
#Использовать ".."

#Область ПередИПосле
&Перед
Процедура ПередЗапускомТеста() Экспорт	

КонецПроцедуры

&После
Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры
#КонецОбласти

&Тест
Процедура СозданиеБазыДанных() Экспорт
	Диван = Новый Диван();
	БазаДанных = Диван.НоваяБазаДанных("new_data_base");
	Диван.Сохранить(БазаДанных);

	Диван = Новый Диван();
	Диван.УстановитьБазуДанных("new_data_base");
	ПолученнаяСущность = Диван.ТекущаяБазаДанных();
	Ожидаем.Что(ПолученнаяСущность.Имя).Равно("new_data_base");

	JSON = Новый Структура;
	JSON.Вставить("name", "admin");
	JSON.Вставить("password", "password");

	Ответ = КоннекторHTTP.Post("localhost:5984/_session", , JSON);
	Параметры = Новый Структура("Cookies", Ответ.Cookies);
	Ответ = КоннекторHTTP.Delete("localhost:5984/new_data_base/", , , Параметры);	
КонецПроцедуры


// oscript.exe .\tasks\coverage.os - для запуска ковереджа