#Использовать asserts
#Использовать entity
#Использовать ".."

&Тест
Процедура БазаДанных() Экспорт
	Авторизация = Новый Структура("name, password", "admin", "password");
	ПараметрыКоннектора = Новый Массив;
	ПараметрыКоннектора.Добавить(Новый Структура("Авторизация", Авторизация));
	МенеджерСущностей = Новый МенеджерСущностей(Тип("КоннекторCouchDB"), "http://localhost:5984", ПараметрыКоннектора);
	МенеджерСущностей.ДобавитьКлассВМодель(Тип("БазаДанных"));
	МенеджерСущностей.ДобавитьКлассВМодель(Тип("Документ"));
	МенеджерСущностей.ДобавитьКлассВМодель(Тип("Вложение"));

	МенеджерСущностей.Инициализировать();
	БазаДанных = Новый БазаДанных;
	БазаДанных.Имя = "test";
	МенеджерСущностей.Сохранить(БазаДанных);

	ПолученнаяСущность = МенеджерСущностей.ПолучитьОдно(Тип("БазаДанных"), Новый Структура("Имя", "test"));
	Ожидаем.Что(ПолученнаяСущность.Имя).Равно("test");
КонецПроцедуры

// oscript.exe .\tasks\coverage.os - для запуска ковереджа